#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//a^0=a
//a^a=0
//异或操作符支持交换律
//int main()
//{
//	int a = 3;
//	int b = 5;
//	printf("交换前：a=%d b=%d\n", a, b);
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("交换后：a=%d b=%d\n", a, b);
//	return 0;
//}
//只限于整型


//求一个整数存储在内存中的二进制中1的个数
//int main()
//{
//	int a = -5;
//	int count = 0;
//	int i = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if (((a >> i) & 1) == 1)
//		{
//			count++;
//		}
//	}
//	printf("二进制中1的个数为：%d\n", count);
//	return 0;
//}

int main()
{
	//int a = 0;
	////~ 是按二进制位取反
	////00000000000000000000000000000000 - 补码
	////11111111111111111111111111111111 -> ~a
	////10000000000000000000000000000001
	////-1
	//printf("%d\n", a);
	//int a = 3;
	////00000000000000000000000000000011
	////11111111111111111111111111111100 - 补码
	////11111111111111111111111111111011
	////10000000000000000000000000000100
	//printf("%d\n", ~a);
	int a = 13;
	a |= (1 << 1);
	printf("%d\n", a);
	a &= ~(1 << 1);
	printf("%d\n", a);
	//00000000000000000000000000001101
	//00000000000000000000000000000010
	//1<<1
	//00000000000000000000000000001111
	return 0;
}

